#include "App_Message.h"
#include "APP_GPS.H"
u8 Message_uPload_Buff[50]={0};

/*************************************************************************************************
*****
***** 函数名：void  Robort_Receive_Frame()
*****
***** 入口参数：pdata--数据帧的指针
*****
***** 功能描述：向UART读取APP发送的数据
*****
***** 调用： STM32_UART_Read()读取数据
*****
***** 返回值：无
*****
***** 作者：Sandy
****				
****  版本：v2.0
****
**************************************************************************************************/
int Robort_Receive_Frame(App_Robort_Dat_Tag *pdata)
{
    uint8 ret = 0;
    
    ret = STM32_UART_Read(STM32_UART1, pdata, sizeof(App_Robort_Dat_Tag));
    if (ret==0)
    {
        return RET_ERROR;
    }
    
    return RET_OK;    
}

/*************************************************************************************************
*****
***** 函数名：void  Robort_Send_Frame()(v1.0没有用到)
*****
***** 入口参数：pdata--数据帧的指针
*****
***** 功能描述：向UART发送机器人获取的传感数据
*****
***** 调用： STM32_UART_Write()读取数据
*****
***** 返回值：无
*****
***** 作者：Sandy
****				
****  版本：v2.0
****
**************************************************************************************************/
void Robort_Send_Frame(void *pdata, uint16 len)
{
     //STM32_UART_Write(STM32_UART1, pdata, sizeof(App_Robort_Dat_Tag));
     STM32_UART1_Write(pdata, len);
}


/*************************************************************************************************
*****
***** 函数名：void  Robort_Uart_Init()
*****
***** 入口参数：无
*****
***** 功能描述：初始化UART
*****
***** 调用： UART_Init()底层的UART实始化函数
*****
***** 返回值：无
*****
***** 作者：Sandy
****				
****  版本：v2.0
****
**************************************************************************************************/
void Robort_Uart_Init(void)
{
    STM32_UART_Init();
}


/******************* (C) COPYRIGHT 2015 X-SPACE *****END OF FILE*********************/
